# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# *Пример:*

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
sp=[2, 3, 4, 5, 6]
print(sp)
lenght = 0
if len(sp) % 2 == 0:
    lenght = len(sp) // 2
else:
    lenght = (len(sp)+1) // 2
for i in range(lenght):
    sp[i]=sp[i]*sp[(i+1)*-1]
sp = sp[0:lenght]    
print(sp)
    





